#+title: duckdb-query.el - Query Anything, Get Elisp
#+options: toc:nil

Query remote Parquet files, local CSVs, org-mode tables, and Elisp data
structures with SQL. Get results as native Elisp values. One function call, no
intermediate files, no external scripts.

#+begin_html
<table align="center"><tr>
    <th width="700px">Query Remote Data, Filter with Elisp, Get Native Structures</th></tr>
<tr><td>

<p><strong>Query joining 336k-row remote Parquet with Elisp alist:</strong></p>
<pre lang="elisp">(let ((carriers '(((code . "UA") (name . "United Airlines"))
                  ((code . "AA") (name . "American Airlines"))
                  ((code . "DL") (name . "Delta Air Lines")))))
  (duckdb-query
   "SELECT c.name as airline,
           {'flights': COUNT(*),
            'avg_delay': ROUND(AVG(f.arr_delay), 1)} as stats
    FROM 'https://github.com/rfsaldanha/releases/releases/download/v1/flights.parquet' f
    JOIN @carriers c ON f.carrier = c.code
    GROUP BY c.name
    ORDER BY COUNT(*) DESC"
   :data `((carriers . ,carriers))
   :format :columnar))</pre>

<p><strong>Result (columnar format with nested structs):</strong></p>
<pre lang="elisp">((airline . ["United Airlines" "Delta Air Lines" "American Airlines"])
 (stats . [((flights . 58665) (avg_delay . 3.6))
           ((flights . 48110) (avg_delay . 1.6))
           ((flights . 32729) (avg_delay . 0.4))]))</pre>
</td></tr></table>
<p align="center"><em>One function call: remote Parquet + Elisp filter → nested Elisp structures</em></p>
#+end_html

DuckDB is an embedded analytical database that reads Parquet, CSV, and JSON
directly from local paths, HTTP URLs, or cloud storage. This package makes
DuckDB's capabilities available to Elisp programs. The ~duckdb-query~ function
executes SQL and returns alists, plists, vectors, or org-table-compatible lists.
Results are ready for ~mapcar~, ~seq-filter~, ~cl-loop~, or direct insertion
into buffers.

** COMMENT  Performance

The package writes results to temporary files by default, providing 3-5x speedup
on large results compared to streaming through stdout:

: | Result Size | Default (file) | Streaming (pipe) | Speedup |
: |-------------+----------------+------------------+---------|
: | 10k rows    | 64ms           | 162ms            | 2.5x    |
: | 100k rows   | 366ms          | 1.28s            | 3.5x    |
: | 500k rows   | 1.32s          | 6.19s            | 4.7x    |

Force streaming mode with ~:output-via :pipe~ when needed. DDL statements
automatically use streaming since they cannot be wrapped in file output.

Profile your specific queries with the benchmark module:

#+begin_src elisp
(duckdb-query-bench-output-strategies
 "SELECT * FROM range(10000) t(i)"
 :iterations 3)
#+end_src

#+RESULTS:
| strategy | mean    | min     | max     | n |
| :file    | 20.62ms | 20.12ms | 21.52ms | 3 |
| :pipe    | 20.84ms | 20.50ms | 21.42ms | 3 |
| :speedup | 1.01x   |         |         |   |

Other benchmark functions: ~duckdb-query-bench-formats~ (compare output formats),
~duckdb-query-bench-nested-types~ (compare nested type handling),
~duckdb-query-bench-data-formats~ (compare ~:data~ serialization).

